/*
__________________
* Сумма квадратов маленьких чисел
__________________

В вести два целых числа a и b (a ≤ b) и вывести сумму квадратов всех чисел от a до b.
_____________________________________
Input format
______________________________________
Два целых числа по модулю не больше 100
_______________
Output format
_______________

Сумма квадратов от первого введенного числа до второго
 * */

#include <stdio.h>

int main(void) {
    int a=0, b=0, sum = 0;
    scanf("%d %d",&a, &b);


    // Проверка диапазона
    if (a < -100 || b > 100 || a > b) {
        printf("Error: the numbers should be in the range from -100 to 100 and a should be b.\n");
        return 1;
    }


     for (int i = a; i <= b; i++) {
      sum+= i * i;
    }
    printf("%d ",sum );

    return 0;
}